
<p align="JUSTIFY">
	<strong>1. FM</strong>
</p>
<p align="JUSTIFY">
	Em telecomunica&#231;&#245;es e processamento de sinal, a modula&#231;&#227;o em frequ&#234;ncia (FM) transmite informa&#231;&#245;es atrav&#233;s de uma
	portadora variando a sua frequ&#234;ncia instant&#226;nea. Est&#225; em oposi&#231;&#227;o com a modula&#231;&#227;o em amplitude, na qual a amplitude da
	portadora varia enquanto a frequ&#234;ncia permanece constante. Em aplica&#231;&#245;es anal&#243;gicas, a diferen&#231;a entre a frequ&#234;ncia
	instant&#226;nea e a frequ&#234;ncia base da portadora &#233; diretamente proporcional ao valor instant&#226;neo da amplitude do sinal de entrada. Dados
	digitais podem ser enviados por uma mudan&#231;a na frequ&#234;ncia da portadora atrav&#233;s de uma variedade de configura&#231;&#245;es, uma t&#233;cnica
	conhecida como Modula&#231;&#227;o por chaveamento de frequ&#234;ncia (FSK). A FSK &#233; largamente utilizada em transmiss&#227;o de dados e fax modem, e
	pode ser utilizada para transmitir c&#243;digo Morse. A Modula&#231;&#227;o em frequ&#234;ncia &#233; utilizada tamb&#233;m em telemetria, radar e
	prospec&#231;&#227;o s&#237;smica. A Modula&#231;&#227;o em frequ&#234;ncia &#233; conhecida como modula&#231;&#227;o em fase quando a modula&#231;&#227;o
	em fase da portadora &#233; a integral do tempo do sinal FM. A FM &#233; largamente utilizada para transmitir m&#250;sica e voz, r&#225;dio bidirecional,
	sistemas de grava&#231;&#227;o em fitas magn&#233;ticas e alguns sistemas de transmiss&#227;o de v&#237;deo. Em sistemas de r&#225;dio, a
	modula&#231;&#227;o em frequ&#234;ncia com largura de banda suficiente fornece uma vantagem em cancelar ru&#237;dos que ocorrem naturalmente.
</p>
<p align="JUSTIFY">
	Iniciada nos Estados Unidos no in&#237;cio do s&#233;culo XX, FM &#233; uma modalidade de radiodifus&#227;o . A faixa de transmiss&#227;o FM, utilizado
	para FM r&#225;dio de transmiss&#227;o por emissoras de r&#225;dio , difere entre as diferentes partes do mundo. Na Europa e &#193;frica (Regi&#227;o 1 da
	UIT), que abrange 87,5-108,0 megahertz (MHz), enquanto na Am&#233;rica (ITU Regi&#227;o 2) que vai apenas 87,7-108,0 MHz. A faixa de transmiss&#227;o FM no
	Jap&#227;o usa 76,0-90 MHz. O OIRT banda em Europa Oriental &#233; 65,8-74,0 MHz, embora esses pa&#237;ses agora usam principalmente a banda MHz 87,5-108,
	como no caso da R&#250;ssia . Alguns outros pa&#237;ses j&#225; descontinuado a banda OIRT e mudaram para a banda MHz 87,5-108.
</p>
<p align="JUSTIFY">
	Uma r&#225;dio em FM apresenta uma &#243;tima qualidade sonora mas com limitado alcance, chegando em m&#233;dia a 100 quil&#244;metros de raio de alcance.
	Em condi&#231;&#245;es espor&#225;dicas de propaga&#231;&#227;o, &#233; poss&#237;vel sintonizar emissores a centenas de quil&#244;metros. A pot&#234;ncia
	dos sistemas de emiss&#227;o pode variar entre poucos watts (r&#225;dios locais) at&#233; centenas de quilowatts, no caso deretransmissores de grande
	cobertura.
</p>
<p align="JUSTIFY">
	O FM disp&#245;e de um sistema de envio de informa&#231;&#227;o digital, o RDS (<em>Radio Data System</em>) que permite apresentar informa&#231;&#245;es
	sobre a emissora sintonizada. Tamb&#233;m, a boa qualidade de som desta gama de frequ&#234;ncias de radiodifus&#227;o &#233; adequada ao uso da
	estereofonia.
</p>
<p align="JUSTIFY">
	A qualidade da transmiss&#227;o por modula&#231;&#227;o em frequ&#234;ncia fez com que esta fosse adotada para a transmiss&#227;o do &#225;udio da TVaberta
	(canais 2 a 13).
</p>
<p>
	<strong>2. Desvantagens</strong>
</p>
<p align="JUSTIFY">
	Uma das desvantagens dos receptores FM &#233; de apresentarem uma caracter&#237;stica conhecida como <em>efeito de captura</em>. Esse efeito ocorre da
	seguinte maneira: se existirem dois ou mais sinais de FM emitidos na mesma frequ&#234;ncia, o receptor de FM ir&#225; responder ao sinal de maior
	pot&#234;ncia e ignorar os menores (os restantes).
</p>
<p align="JUSTIFY">
	Pode variar de sinal (conforme a dist&#226;ncia) podendo oscilar por exemplo de lugares mais altos e baixos.
</p>
