
<p align="JUSTIFY">
    <strong>1. Fun&#231;&#227;o</strong>
</p>

<p align="JUSTIFY">
    Toda fun&#231;&#227;o &#233; uma rela&#231;&#227;o estabelecida entre dois conjuntos A e B, onde exista uma associa&#231;&#227;o entre cada elemento de A
    com um &#250;nico de B atrav&#233;s de uma lei de forma&#231;&#227;o &#233; considerada uma fun&#231;&#227;o. Observe o exemplo abaixo.
	<p align="CENTER">
		<img src="./Assuntos/Funcoes/f1.jpg"/>
	</p>
</p>

<p align="JUSTIFY">
    O estudo das fun&#231;&#245;es se apresenta em v&#225;rios segmentos, de acordo com a rela&#231;&#227;o entre os conjuntos podemos obter in&#250;meras leis
    de forma&#231;&#227;o. Dentre os estudos das fun&#231;&#245;es temos: fun&#231;&#227;o do 1&#186; grau, fun&#231;&#227;o do 2&#186; grau, fun&#231;&#227;o
    exponencial, fun&#231;&#227;o modular, fun&#231;&#227;o trigonom&#233;trica, fun&#231;&#227;o logar&#237;tmica, fun&#231;&#227;o polinomial. Cada
    fun&#231;&#227;o possui uma propriedade e &#233; definida por leis generalizadas. As fun&#231;&#245;es possuem representa&#231;&#245;es geom&#233;tricas no
    plano cartesiano, as rela&#231;&#245;es entre pares ordenados (x,y) s&#227;o de extrema import&#226;ncia no estudo dos gr&#225;ficos de fun&#231;&#245;es,
    pois a an&#225;lise dos gr&#225;ficos demonstram de forma geral as solu&#231;&#245;es dos problemas propostos com o uso de rela&#231;&#245;es de
    depend&#234;ncia, especificadamente, as fun&#231;&#245;es.
<p>

<p align="JUSTIFY">
    As fun&#231;&#245;es possuem um conjunto denominado dom&#237;nio e outro chamado de imagem da fun&#231;&#227;o, no plano cartesiano o eixo x representa o
    dom&#237;nio da fun&#231;&#227;o, enquanto o eixo y representa os valores obtidos em fun&#231;&#227;o de x, constituindo a imagem da fun&#231;&#227;o. Como pode ser
    visto na figura abaixo.
	<p align="CENTER">
		<img src="./Assuntos/Funcoes/f2.jpg"/>
	</p>
</p>

<p align="JUSTIFY">
    Um exemplo de rela&#231;&#227;o de fun&#231;&#227;o pode ser expresso por uma lei de forma&#231;&#227;o que relaciona: o pre&#231;o a ser pago em
    fun&#231;&#227;o da quantidade de litros de combust&#237;vel abastecidos. Considerando o pre&#231;o da gasolina igual a R$ 2,50, temos a seguinte lei de
    forma&#231;&#227;o: <strong><em>f(x) = 2,50*x</em></strong>, onde f(x): pre&#231;o a pagar e x: quantidade de litros. Observe a tabela abaixo:
</p>

	<p align="CENTER">
		<img src="./Assuntos/Funcoes/f3.jpg"/>
	</p>

<p align="JUSTIFY">
    Verifique que para cada valor de x temos uma representa&#231;&#227;o em f(x), esse modelo &#233; um t&#237;pico exemplo de fun&#231;&#227;o do 1&#186;
    grau.
</p>


