
< lang="pt-PT">

<p lang="pt-PT" align="JUSTIFY">
	<strong>1. Modula&#231;&#227;o </strong>
</p>

<p align="CENTER">
	<img src="./Assuntos/Modulacao/m1.gif"></div> 
</p>

<p align="JUSTIFY">
	&#201; o processo de varia&#231;&#227;o de altura (amplitude), de intensidade, frequ&#234;ncia, do comprimento e/ou da fase de onda numa onda de
	transporte, que deforma uma das caracter&#237;sticas de um sinal portador (amplitude, fase ou frequ&#234;ncia) que varia proporcionalmente ao sinal
	modulador.
</p>
<align="JUSTIFY">
	<strong>2. Em telecomunica&#231;&#245;es</strong>
<p align="JUSTIFY">
	Em telecomunica&#231;&#245;es, a modula&#231;&#227;o &#233; a modifica&#231;&#227;o de um sinal eletromagn&#233;tico inicialmente gerado, antes de ser
	irradiado, de forma que este transporte informa&#231;&#227;o sobre uma onda portadora.
</p>
<p align="JUSTIFY">
	Modula&#231;&#227;o &#233; o processo no qual a informa&#231;&#227;o a transmitir numa comunica&#231;&#227;o &#233; adicionada a ondas
	eletromagn&#233;ticas. O transmissor adiciona a informa&#231;&#227;o numa onda especial de tal forma que poder&#225; ser recuperada na outra parte
	atrav&#233;s de um processo reverso chamado demodula&#231;&#227;o.
</p>
<p align="JUSTIFY">
	A maioria dos sinais, da forma como s&#227;o fornecidos pelo transmissor, n&#227;o podem ser enviados diretamente atrav&#233;s dos canais de
	transmiss&#227;o. Conseq&#252;entemente, &#233; necess&#225;rio modificar esse sinal atrav&#233;s de uma onda eletromagn&#233;tica portadora, cujas
	propriedades s&#227;o mais convenientes aos meios de transmiss&#227;o. A modula&#231;&#227;o &#233; a altera&#231;&#227;o sistem&#225;tica de uma onda
	portadora de acordo com a mensagem (sinal modulante), e pode incluir tamb&#233;m uma codifica&#231;&#227;o.
</p>
<p lang="pt-PT" align="JUSTIFY">
	&#201; interessante notar que muitas formas de comunica&#231;&#227;o envolvem um processo de modula&#231;&#227;o, como a fala por exemplo. Quando uma
	pessoa fala, os movimentos da boca s&#227;o realizados a taxas de freq&#252;&#234;ncia baixas, na ordem dos 10 Hertz, n&#227;o podendo a esta
	freq&#252;&#234;ncia produzir ondas ac&#250;sticas propag&#225;veis. A transmiss&#227;o da voz atrav&#233;s do ar &#233; conseguida pela gera&#231;&#227;o
	de tons (ondas) portadores de alta frequ&#234;ncia nas cordas vocais, modulando estes tons com as a&#231;&#245;es musculares da cavidade bucal. O que o
	ouvido interpreta como fala &#233;, portanto, uma onda ac&#250;stica modulada, similar, em muitos aspectos, a uma onda el&#233;trica modulada.
</p>
<p align="JUSTIFY">
	O dispositivo que realiza a modula&#231;&#227;o &#233; chamado <em>modulador</em>.
</p>
<p lang="pt-PT" align="JUSTIFY">
	Basicamente, a modula&#231;&#227;o consiste em fazer com que um par&#226;metro da onda portadora mude de valor de acordo com a varia&#231;&#227;o do sinal
	modulante, que &#233; a informa&#231;&#227;o que se deseja transmitir.
</p>
<p lang="pt-PT" align="JUSTIFY">
	Dependendo do par&#226;metro sobre o qual se atue, temos os seguintes tipos de modula&#231;&#227;o:
</p>
<ul>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o em amplitude (AM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o em fase (PM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o em freq&#252;&#234;ncia (FM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o em banda lateral dupla (DSB)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o em banda lateral &#250;nica (SSB)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o de banda lateral vestigial (VSB, ou VSB-AM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o de amplitude em quadratura (QAM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por divis&#227;o ortogonal de freq&#252;&#234;ncia (OFDM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
Quando a OFDM &#233; utilizada em conjun&#231;&#227;o com t&#233;cnicas de codifica&#231;&#227;o de canal, se denomina			<em>Modula&#231;&#227;o por divis&#227;o ortogonal de freq&#252;&#234;ncia codificada</em> (COFDM).
		</p>
	</li>
</ul>
<p lang="pt-PT" align="JUSTIFY">
	Tamb&#233;m se empregam t&#233;cnicas de modula&#231;&#227;o por pulsos, entre elas:
</p>
<ul>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por pulso codificado (PCM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por largura de pulso (PWM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por amplitude de pulso (PAM)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por posi&#231;&#227;o de pulso (PPM)
		</p>
	</li>
	<li>
	</li>
</ul>
<p align="JUSTIFY">
	Quando o sinal modulador &#233; um sinal digital, com um conjunto de s&#237;mbolos digitais (p.ex, 0 ou 1), transmitidos (chaveados) em determinada
	velocidade de codifica&#231;&#227;o (bauds), designa-se essas modula&#231;&#245;es, com uma transi&#231;&#227;o abrupta de s&#237;mbolos, por:
</p>
<ul>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por chaveamento de amplitude (ASK)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por chaveamento de freq&#252;&#234;ncia (FSK)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por chaveamento de fase (PSK)
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Modula&#231;&#227;o por chaveamento de fase e amplitude (APSK ou APK)
		</p>
	</li>
</ul>
<lang="pt-PT">
	<a name="Notas"></a>
<p align="JUSTIFY">
	<strong>3. Notas</strong>
</p>
<ul>
	<li>
		<p align="JUSTIFY">
Uma das t&#233;cnicas pioneiras de modula&#231;&#227;o, onde o sinal da portadora &#233; uma simples indica&#231;&#227;o de			<em>ligado-desligado</em>, fundamentou a transmiss&#227;o de mensagens atrav&#233;s do c&#243;digo Morse por fios el&#233;tricos.
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			<a name="cite_ref-1"></a>
			Os sinais anal&#243;gicos de televis&#227;o t&#234;m modula&#231;&#227;o em amplitude para o sinal de v&#237;deo e modula&#231;&#227;o em
			frequ&#234;ncia para o &#225;udio. Com o sinal digital a modula&#231;&#227;o &#233; a mesma para v&#237;deo e &#225;udio.1
		</p>
	</li>
	<li>
		<p align="JUSTIFY">
			Algumas <em>radioestrelas</em> emitem modula&#231;&#245;es em freq&#252;&#234;ncia e amplitude simultaneamente.
		</p>
	</li>
</ul>
