<p align="JUSTIFY">
	<strong>1. AM</strong>
</p>
<p align="JUSTIFY">
	Modula&#231;&#227;o em Amplitude ou simplesmente AM (do ingl&#234;s <em>Amplitude Modulation</em> - Modula&#231;&#227;o de Amplitude), &#233; a forma de
	modula&#231;&#227;o em que a amplitude de um sinal senoidal, chamado portadora, varia em fun&#231;&#227;o do sinal de interesse, que &#233; o sinal
	modulador. A frequ&#234;ncia e afase da portadora s&#227;o mantidas constantes. Matematicamente, &#233; uma aplica&#231;&#227;o direta da propriedade de
	deslocamentos em frequ&#234;ncias datransformada de Fourier, assim como da propriedade da convolu&#231;&#227;o.
</p>
<align="JUSTIFY">
	<strong>2. Defini&#231;&#227;o de amplitude modulada internacionalmente</strong>
<p align="JUSTIFY">
	No caso de transmiss&#227;o de sinais, o modelo adotato pelo <em>Bureau of Naval Personel Training Publications Division</em>, e seguido pelo ocidente para
	definir o AM, diz que a
	<em>
		"Amplitude Modulada &#233; a varia&#231;&#227;o da intensidade de sa&#237;da de RF (R&#225;dio Frequ&#234;ncia) do transmissor a uma velocidade de
		&#225;udio"
	</em>
	. A tens&#227;o de sa&#237;da do radiotransmissor tem uma varia&#231;&#227;o que oscila para cima e para baixo de seu valor nominal de acordo com a
	frequ&#234;ncia de &#225;udio. (Ver exemplos demonstrados nos par&#225;grafos abaixo).
</p>
<p align="JUSTIFY">
	Para &#225;udio de alta frequ&#234;ncia, a radiofrequ&#234;ncia ter&#225; uma varia&#231;&#227;o em amplitude mais r&#225;pida, para &#225;udio de baixa
	frequ&#234;ncia, esta varia&#231;&#227;o ser&#225; mais lenta. Logo, a varia&#231;&#227;o da portadora de RF deve corresponder em amplitude a
	varia&#231;&#227;o ocasionada pelo &#193;udio. A resultante de modula&#231;&#227;o em amplitude para uma frequ&#234;ncia de &#225;udio fixa pode ser
	separada para an&#225;lise do processo em tr&#234;s ondas distintas cuja amplitude &#233; constante.
</p>
<p align="JUSTIFY">
	O Sistema de Modula&#231;&#227;o em Amplitude &#233; o sistema de modula&#231;&#227;o mais antigo (1980). Existem diversos tipos de sistemas de
	modula&#231;&#227;o em amplitude, destacando-se: AM-DSB (Amplitude Modulation Double SideBand), AM-SSB (Amplitude Modulation Single SideBand) e AM-VSB
	(Amplitude Modulation Vestigial SideBand). Os sistemas anteriores ainda podem ser subdivididos em rela&#231;&#227;o a exist&#234;ncia ou n&#227;o da
	portadora no sinal modulado: AM-DSB/SC: Amplitude Modulation Double SideBand with Supressed Carrier AM-SSB/SC: Amplitude Modulation Single SideBand with
	Supressed Carrier AM-VSB/SC: Amplitude Modulation Vestigial SideBand with Supressed Carrier
</p>
<align="JUSTIFY">
	<strong>3. Motiva&#231;&#227;o</strong>
<p align="JUSTIFY">
	A transmiss&#227;o de r&#225;dio &#233; feita atrav&#233;s da difus&#227;o de ondas eletro-magn&#233;ticas. Estas s&#227;o transmitidas no ar mais
	eficientemente em altas frequ&#234;ncias do que em baixas frequ&#234;ncias. Isso porque, de modo geral, o tamanho da antena que deve receber um sinal de
	r&#225;dio &#233; diretamente proporcional ao comprimento de onda transmitida. Se fosse desejado transmitir ondas com frequ&#234;ncias equivalentes &#224;s
	frequ&#234;ncias de voz (da ordem de 80hz a 1500Hz, segundo FOLMER-JOHNSON - 1968 e EFRON - 1969 [1]), seriam necess&#225;rias antenas de
	propor&#231;&#245;es gigantescas. Por este motivo, foi necess&#225;rio encontrar alguma forma de transmitir as informa&#231;&#245;es usando ondas de alta
	frequ&#234;ncia.
</p>
<p align="JUSTIFY">
	Outra necessidade atendida pela modula&#231;&#227;o de ondas foi a necessidade de se compartilhar um meio de transmiss&#227;o, no caso o ar, entre um
	n&#250;mero de transmissores. Para alcan&#231;ar este objetivo, basta usar a mensagem para modular ondas de frequ&#234;ncias diferentes. Desta forma, o
	receptor pode "selecionar" uma frequ&#234;ncia para demodular retirando assim a informa&#231;&#227;o apenas de um transmissor. Isto &#233; exatamente o que
	fazemos quando selecionamos uma esta&#231;&#227;o de r&#225;dio ou um canal de televis&#227;o.
</p>
<p align="JUSTIFY">
	A solu&#231;&#227;o foi justamente modular as ondas de alta frequ&#234;ncia de modo que a informa&#231;&#227;o a ser transmitida esteja contida nestas
	ondas e possam ser transmitidas eficientemente pelo ar. Esta informa&#231;&#227;o poderia ser facilmente recuperada num receptor de r&#225;dio,
	atrav&#233;s de um processo chamado demodula&#231;&#227;o.
</p>
<align="JUSTIFY">
	<strong>4. M&#233;todos de modula&#231;&#227;o</strong>
<p align="JUSTIFY">
	Originalmente, a modula&#231;&#227;o em amplitude era feita transmitindo-se uma portadora com uma amplitude de base e alterando-se esta amplitude em
	fun&#231;&#227;o da mensagem que queria-se transmitir. Este tipo foi chamado de modula&#231;&#227;o AM DSB-FC <em>(double-sideband full carrier)</em>. Como
	ser&#225; explicado a seguir, neste tipo de modula&#231;&#227;o, al&#233;m da portadora s&#227;o transmitidos dois outros conjuntos de frequ&#234;ncias
	(espectros) chamadas de bandas laterais, nas quais est&#225; contida a mensagem a ser transmitida.
</p>
<p align="JUSTIFY">
	A modula&#231;&#227;o AM DSB-FC &#233; altamente ineficiente pois a maior parte da pot&#234;ncia gerada &#233; usada para transmitir a portadora, e
	n&#227;o a mensagem. Eventualmente descobriu-se que n&#227;o era necess&#225;rio enviar a portadora acompanhada das bandas laterais, mas era poss&#237;vel
	enviar apenas as bandas laterais, onde estava contida a mensagem, evitando assim gastos desnecess&#225;rios na portadora. A esta modula&#231;&#227;o deu-se
	o nome de modula&#231;&#227;o AM DSB-SC <em>(double-sideband supressed carrier)</em> uma vez que a portadora havia sido suprimida. Este m&#233;todo
	possu&#237;a a desvantagem, no entanto, de exigir circuitos mais complexos na demodula&#231;&#227;o do sinal.
</p>
<p align="JUSTIFY">
	Como evolu&#231;&#227;o deste &#250;ltimo m&#233;todo, ficou claro que n&#227;o apenas era poss&#237;vel enviar as bandas laterais sem a portadora, mas era
poss&#237;vel enviar apenas uma banda, sem perda de informa&#231;&#227;o. A este tipo de modula&#231;&#227;o se deu o nome de modula&#231;&#227;o AM SSB	<em>(single-sideband)</em>, por possuir apenas uma banda. Este, apesar de ser o m&#233;todo mais eficiente, &#233; tamb&#233;m o mais complexo de se
	modular e demodular.
</p>
<p align="JUSTIFY">
	Finalmente, como um compromisso entre efici&#234;ncia e complexidade, foi criada a modula&#231;&#227;o AM VSB <em>(vestigial-sideband)</em>, onde uma banda
	&#233; transmitida por inteiro e a outra &#233; parcialmente suprimida (de a&#237; o nome vestigial).
</p>
<p align="JUSTIFY">
	<strong>5. Forma padr&#227;o</strong>
</p>
<p align="JUSTIFY">
	A forma padr&#227;o de uma onda modulada em amplitude (AM) &#233; definida como:
</p>
<p align="CENTER">
	<img src="./Assuntos/AM/am-1.png"></div>
</p>

